program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}})]
{
    func main<ios17>(tensor<fp16, [1, 128, 1, 3000]> melspectrogram_features) {
            tensor<int32, [2]> var_90 = const()[name = tensor<string, []>("op_90"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_96 = const()[name = tensor<string, []>("op_96"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_101 = const()[name = tensor<string, []>("op_101"), val = tensor<int32, []>(1)];
            tensor<string, []> var_106_pad_type_0 = const()[name = tensor<string, []>("op_106_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_106_pad_0 = const()[name = tensor<string, []>("op_106_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<fp16, [1280, 128, 1, 3]> var_81_to_fp16 = const()[name = tensor<string, []>("op_81_to_fp16"), val = tensor<fp16, [1280, 128, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1280]> var_87_to_fp16 = const()[name = tensor<string, []>("op_87_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(983168)))];
            tensor<fp16, [1, 1280, 1, 3000]> var_106_cast_fp16 = conv(bias = var_87_to_fp16, dilations = var_96, groups = var_101, pad = var_106_pad_0, pad_type = var_106_pad_type_0, strides = var_90, weight = var_81_to_fp16, x = melspectrogram_features)[name = tensor<string, []>("op_106_cast_fp16")];
            tensor<string, []> hidden_states_1_mode_0 = const()[name = tensor<string, []>("hidden_states_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 1, 3000]> hidden_states_1_cast_fp16 = gelu(mode = hidden_states_1_mode_0, x = var_106_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<int32, [2]> var_130 = const()[name = tensor<string, []>("op_130"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_136 = const()[name = tensor<string, []>("op_136"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_141 = const()[name = tensor<string, []>("op_141"), val = tensor<int32, []>(1)];
            tensor<string, []> var_146_pad_type_0 = const()[name = tensor<string, []>("op_146_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_146_pad_0 = const()[name = tensor<string, []>("op_146_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<fp16, [1280, 1280, 1, 3]> var_121_to_fp16 = const()[name = tensor<string, []>("op_121_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(985792)))];
            tensor<fp16, [1280]> var_127_to_fp16 = const()[name = tensor<string, []>("op_127_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10816256)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_146_cast_fp16 = conv(bias = var_127_to_fp16, dilations = var_136, groups = var_141, pad = var_146_pad_0, pad_type = var_146_pad_type_0, strides = var_130, weight = var_121_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_146_cast_fp16")];
            tensor<string, []> hidden_states_3_mode_0 = const()[name = tensor<string, []>("hidden_states_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 1, 1500]> hidden_states_3_cast_fp16 = gelu(mode = hidden_states_3_mode_0, x = var_146_cast_fp16)[name = tensor<string, []>("hidden_states_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> var_164_to_fp16 = const()[name = tensor<string, []>("op_164_to_fp16"), val = tensor<fp16, [1, 1280, 1, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10818880)))];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_1_cast_fp16 = add(x = hidden_states_3_cast_fp16, y = var_164_to_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_178 = const()[name = tensor<string, []>("op_178"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_180 = const()[name = tensor<string, []>("op_180"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_181 = const()[name = tensor<string, []>("op_181"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_191 = const()[name = tensor<string, []>("op_191"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_1_cast_fp16 = reduce_mean(axes = var_191, keep_dims = var_181, x = inputs_1_cast_fp16)[name = tensor<string, []>("channels_mean_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_1_cast_fp16 = sub(x = inputs_1_cast_fp16, y = channels_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_sq_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = zero_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_sq_1_cast_fp16")];
            tensor<int32, [1]> var_195 = const()[name = tensor<string, []>("op_195"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_196_cast_fp16 = reduce_mean(axes = var_195, keep_dims = var_181, x = zero_mean_sq_1_cast_fp16)[name = tensor<string, []>("op_196_cast_fp16")];
            tensor<fp16, []> var_197_to_fp16 = const()[name = tensor<string, []>("op_197_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_198_cast_fp16 = add(x = var_196_cast_fp16, y = var_197_to_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<fp32, []> denom_1_epsilon_0 = const()[name = tensor<string, []>("denom_1_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1500]> denom_1_cast_fp16 = rsqrt(epsilon = denom_1_epsilon_0, x = var_198_cast_fp16)[name = tensor<string, []>("denom_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> out_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = denom_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [1280]> obj_1_mean_0_to_fp16 = const()[name = tensor<string, []>("obj_1_mean_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14658944)))];
            tensor<fp16, [1280]> obj_1_variance_0_to_fp16 = const()[name = tensor<string, []>("obj_1_variance_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14661568)))];
            tensor<fp16, [1280]> obj_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_1_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14664192)))];
            tensor<fp16, [1280]> obj_1_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_1_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14666816)))];
            tensor<fp16, []> obj_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> obj_1_cast_fp16 = batch_norm(beta = obj_1_beta_0_to_fp16, epsilon = obj_1_epsilon_0_to_fp16, gamma = obj_1_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_1_cast_fp16)[name = tensor<string, []>("obj_1_cast_fp16")];
            tensor<int32, [2]> var_216 = const()[name = tensor<string, []>("op_216"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_218 = const()[name = tensor<string, []>("op_218"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_1_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_1_pad_0 = const()[name = tensor<string, []>("pretrained_out_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_q_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14669440))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15488704))), name = tensor<string, []>("layers_0_self_attn_q_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_q_proj_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15488832)))];
            tensor<fp16, [1, 1280, 1, 1500]> pretrained_out_1_cast_fp16 = conv(bias = layers_0_self_attn_q_proj_pretrained_bias_to_fp16, dilations = var_218, groups = var_180, pad = pretrained_out_1_pad_0, pad_type = pretrained_out_1_pad_type_0, strides = var_216, weight = layers_0_self_attn_q_proj_pretrained_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("pretrained_out_1_cast_fp16")];
            tensor<int32, [2]> var_222 = const()[name = tensor<string, []>("op_222"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_224 = const()[name = tensor<string, []>("op_224"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_self_attn_q_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15491456)))];
            tensor<fp16, [1, 16, 1, 1500]> input_1_cast_fp16 = conv(dilations = var_224, groups = var_180, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_222, weight = layers_0_self_attn_q_proj_loraA_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [2]> var_228 = const()[name = tensor<string, []>("op_228"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_230 = const()[name = tensor<string, []>("op_230"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_1_pad_type_0 = const()[name = tensor<string, []>("lora_out_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_1_pad_0 = const()[name = tensor<string, []>("lora_out_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_3_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_3_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15532480)))];
            tensor<fp16, [1, 1280, 1, 1500]> lora_out_3_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_230, groups = var_180, pad = lora_out_1_pad_0, pad_type = lora_out_1_pad_type_0, strides = var_228, weight = lora_out_3_weight_0_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("lora_out_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> query_1_cast_fp16 = add(x = pretrained_out_1_cast_fp16, y = lora_out_3_cast_fp16)[name = tensor<string, []>("query_1_cast_fp16")];
            tensor<int32, [2]> var_240 = const()[name = tensor<string, []>("op_240"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_242 = const()[name = tensor<string, []>("op_242"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_3_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_3_pad_0 = const()[name = tensor<string, []>("pretrained_out_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_k_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15573504))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16392768))), name = tensor<string, []>("layers_0_self_attn_k_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> pretrained_out_3_cast_fp16 = conv(dilations = var_242, groups = var_180, pad = pretrained_out_3_pad_0, pad_type = pretrained_out_3_pad_type_0, strides = var_240, weight = layers_0_self_attn_k_proj_pretrained_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("pretrained_out_3_cast_fp16")];
            tensor<int32, [2]> var_246 = const()[name = tensor<string, []>("op_246"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_248 = const()[name = tensor<string, []>("op_248"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_self_attn_k_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_k_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16392896)))];
            tensor<fp16, [1, 16, 1, 1500]> input_3_cast_fp16 = conv(dilations = var_248, groups = var_180, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_246, weight = layers_0_self_attn_k_proj_loraA_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [2]> var_252 = const()[name = tensor<string, []>("op_252"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_254 = const()[name = tensor<string, []>("op_254"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_5_pad_type_0 = const()[name = tensor<string, []>("lora_out_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_5_pad_0 = const()[name = tensor<string, []>("lora_out_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_7_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_7_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16433920)))];
            tensor<fp16, [1, 1280, 1, 1500]> lora_out_7_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_254, groups = var_180, pad = lora_out_5_pad_0, pad_type = lora_out_5_pad_type_0, strides = var_252, weight = lora_out_7_weight_0_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("lora_out_7_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> key_1_cast_fp16 = add(x = pretrained_out_3_cast_fp16, y = lora_out_7_cast_fp16)[name = tensor<string, []>("key_1_cast_fp16")];
            tensor<int32, [2]> var_265 = const()[name = tensor<string, []>("op_265"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_267 = const()[name = tensor<string, []>("op_267"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_5_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_5_pad_0 = const()[name = tensor<string, []>("pretrained_out_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_v_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16474944))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17294208))), name = tensor<string, []>("layers_0_self_attn_v_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_v_proj_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17294336)))];
            tensor<fp16, [1, 1280, 1, 1500]> pretrained_out_5_cast_fp16 = conv(bias = layers_0_self_attn_v_proj_pretrained_bias_to_fp16, dilations = var_267, groups = var_180, pad = pretrained_out_5_pad_0, pad_type = pretrained_out_5_pad_type_0, strides = var_265, weight = layers_0_self_attn_v_proj_pretrained_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("pretrained_out_5_cast_fp16")];
            tensor<int32, [2]> var_271 = const()[name = tensor<string, []>("op_271"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_273 = const()[name = tensor<string, []>("op_273"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_self_attn_v_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17296960)))];
            tensor<fp16, [1, 16, 1, 1500]> input_5_cast_fp16 = conv(dilations = var_273, groups = var_180, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = var_271, weight = layers_0_self_attn_v_proj_loraA_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [2]> var_277 = const()[name = tensor<string, []>("op_277"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_279 = const()[name = tensor<string, []>("op_279"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_9_pad_type_0 = const()[name = tensor<string, []>("lora_out_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_9_pad_0 = const()[name = tensor<string, []>("lora_out_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_11_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_11_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17337984)))];
            tensor<fp16, [1, 1280, 1, 1500]> lora_out_11_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_279, groups = var_180, pad = lora_out_9_pad_0, pad_type = lora_out_9_pad_type_0, strides = var_277, weight = lora_out_11_weight_0_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("lora_out_11_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> value_1_cast_fp16 = add(x = pretrained_out_5_cast_fp16, y = lora_out_11_cast_fp16)[name = tensor<string, []>("value_1_cast_fp16")];
            tensor<int32, [4]> var_286 = const()[name = tensor<string, []>("op_286"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_287_cast_fp16 = reshape(shape = var_286, x = query_1_cast_fp16)[name = tensor<string, []>("op_287_cast_fp16")];
            tensor<fp16, []> var_288_to_fp16 = const()[name = tensor<string, []>("op_288_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 20, 64, 1500]> var_289_cast_fp16 = mul(x = var_287_cast_fp16, y = var_288_to_fp16)[name = tensor<string, []>("op_289_cast_fp16")];
            tensor<int32, [4]> var_290 = const()[name = tensor<string, []>("op_290"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_291_cast_fp16 = reshape(shape = var_290, x = key_1_cast_fp16)[name = tensor<string, []>("op_291_cast_fp16")];
            tensor<bool, []> mh_w_1_transpose_x_0 = const()[name = tensor<string, []>("mh_w_1_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_1_transpose_y_0 = const()[name = tensor<string, []>("mh_w_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1500, 1500]> mh_w_1_cast_fp16 = matmul(transpose_x = mh_w_1_transpose_x_0, transpose_y = mh_w_1_transpose_y_0, x = var_289_cast_fp16, y = var_291_cast_fp16)[name = tensor<string, []>("mh_w_1_cast_fp16")];
            tensor<fp16, [1, 20, 1500, 1500]> var_294_cast_fp16 = softmax(axis = var_178, x = mh_w_1_cast_fp16)[name = tensor<string, []>("op_294_cast_fp16")];
            tensor<int32, [4]> var_295 = const()[name = tensor<string, []>("op_295"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_296_cast_fp16 = reshape(shape = var_295, x = value_1_cast_fp16)[name = tensor<string, []>("op_296_cast_fp16")];
            tensor<bool, []> attn_1_transpose_x_0 = const()[name = tensor<string, []>("attn_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_0 = const()[name = tensor<string, []>("attn_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 20, 64, 1500]> attn_1_cast_fp16 = matmul(transpose_x = attn_1_transpose_x_0, transpose_y = attn_1_transpose_y_0, x = var_296_cast_fp16, y = var_294_cast_fp16)[name = tensor<string, []>("attn_1_cast_fp16")];
            tensor<int32, [4]> var_299 = const()[name = tensor<string, []>("op_299"), val = tensor<int32, [4]>([1, 1280, 1, -1])];
            tensor<fp16, [1, 1280, 1, 1500]> input_7_cast_fp16 = reshape(shape = var_299, x = attn_1_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [2]> var_306 = const()[name = tensor<string, []>("op_306"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_308 = const()[name = tensor<string, []>("op_308"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_7_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_7_pad_0 = const()[name = tensor<string, []>("pretrained_out_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_o_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17379008))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18198272))), name = tensor<string, []>("layers_0_self_attn_o_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_o_proj_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_o_proj_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18198400)))];
            tensor<fp16, [1, 1280, 1, 1500]> pretrained_out_7_cast_fp16 = conv(bias = layers_0_self_attn_o_proj_pretrained_bias_to_fp16, dilations = var_308, groups = var_180, pad = pretrained_out_7_pad_0, pad_type = pretrained_out_7_pad_type_0, strides = var_306, weight = layers_0_self_attn_o_proj_pretrained_weight_to_fp16_palettized, x = input_7_cast_fp16)[name = tensor<string, []>("pretrained_out_7_cast_fp16")];
            tensor<int32, [2]> var_312 = const()[name = tensor<string, []>("op_312"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_314 = const()[name = tensor<string, []>("op_314"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_self_attn_o_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_o_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18201024)))];
            tensor<fp16, [1, 16, 1, 1500]> input_9_cast_fp16 = conv(dilations = var_314, groups = var_180, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_312, weight = layers_0_self_attn_o_proj_loraA_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [2]> var_318 = const()[name = tensor<string, []>("op_318"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_320 = const()[name = tensor<string, []>("op_320"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_13_pad_type_0 = const()[name = tensor<string, []>("lora_out_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_13_pad_0 = const()[name = tensor<string, []>("lora_out_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_15_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_15_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18242048)))];
            tensor<fp16, [1, 1280, 1, 1500]> lora_out_15_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_320, groups = var_180, pad = lora_out_13_pad_0, pad_type = lora_out_13_pad_type_0, strides = var_318, weight = lora_out_15_weight_0_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("lora_out_15_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> obj_3_cast_fp16 = add(x = pretrained_out_7_cast_fp16, y = lora_out_15_cast_fp16)[name = tensor<string, []>("obj_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = obj_3_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> var_329 = const()[name = tensor<string, []>("op_329"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_3_cast_fp16 = reduce_mean(axes = var_329, keep_dims = var_181, x = inputs_3_cast_fp16)[name = tensor<string, []>("channels_mean_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_3_cast_fp16 = sub(x = inputs_3_cast_fp16, y = channels_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_sq_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = zero_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_sq_3_cast_fp16")];
            tensor<int32, [1]> var_333 = const()[name = tensor<string, []>("op_333"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_334_cast_fp16 = reduce_mean(axes = var_333, keep_dims = var_181, x = zero_mean_sq_3_cast_fp16)[name = tensor<string, []>("op_334_cast_fp16")];
            tensor<fp16, []> var_335_to_fp16 = const()[name = tensor<string, []>("op_335_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_336_cast_fp16 = add(x = var_334_cast_fp16, y = var_335_to_fp16)[name = tensor<string, []>("op_336_cast_fp16")];
            tensor<fp32, []> denom_3_epsilon_0 = const()[name = tensor<string, []>("denom_3_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1500]> denom_3_cast_fp16 = rsqrt(epsilon = denom_3_epsilon_0, x = var_336_cast_fp16)[name = tensor<string, []>("denom_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> out_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = denom_3_cast_fp16)[name = tensor<string, []>("out_3_cast_fp16")];
            tensor<fp16, [1280]> input_11_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_11_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18283072)))];
            tensor<fp16, [1280]> input_11_beta_0_to_fp16 = const()[name = tensor<string, []>("input_11_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18285696)))];
            tensor<fp16, []> input_11_epsilon_0_to_fp16 = const()[name = tensor<string, []>("input_11_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> input_11_cast_fp16 = batch_norm(beta = input_11_beta_0_to_fp16, epsilon = input_11_epsilon_0_to_fp16, gamma = input_11_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_3_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [2]> var_350 = const()[name = tensor<string, []>("op_350"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_352 = const()[name = tensor<string, []>("op_352"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_9_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_9_pad_0 = const()[name = tensor<string, []>("pretrained_out_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [5120, 1280, 1, 1]> layers_0_fc1_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3276800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18288320))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21565184))), name = tensor<string, []>("layers_0_fc1_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([5120, 1280, 1, 1])];
            tensor<fp16, [5120]> layers_0_fc1_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_fc1_pretrained_bias_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21565312)))];
            tensor<fp16, [1, 5120, 1, 1500]> pretrained_out_9_cast_fp16 = conv(bias = layers_0_fc1_pretrained_bias_to_fp16, dilations = var_352, groups = var_180, pad = pretrained_out_9_pad_0, pad_type = pretrained_out_9_pad_type_0, strides = var_350, weight = layers_0_fc1_pretrained_weight_to_fp16_palettized, x = input_11_cast_fp16)[name = tensor<string, []>("pretrained_out_9_cast_fp16")];
            tensor<int32, [2]> var_356 = const()[name = tensor<string, []>("op_356"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_358 = const()[name = tensor<string, []>("op_358"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_fc1_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_fc1_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21575616)))];
            tensor<fp16, [1, 16, 1, 1500]> input_13_cast_fp16 = conv(dilations = var_358, groups = var_180, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_356, weight = layers_0_fc1_loraA_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<int32, [2]> var_362 = const()[name = tensor<string, []>("op_362"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_364 = const()[name = tensor<string, []>("op_364"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_17_pad_type_0 = const()[name = tensor<string, []>("lora_out_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_17_pad_0 = const()[name = tensor<string, []>("lora_out_17_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [5120, 16, 1, 1]> lora_out_19_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_19_weight_0_to_fp16"), val = tensor<fp16, [5120, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21616640)))];
            tensor<fp16, [5120]> lora_out_19_bias_0_to_fp16 = const()[name = tensor<string, []>("lora_out_19_bias_0_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21780544)))];
            tensor<fp16, [1, 5120, 1, 1500]> lora_out_19_cast_fp16 = conv(bias = lora_out_19_bias_0_to_fp16, dilations = var_364, groups = var_180, pad = lora_out_17_pad_0, pad_type = lora_out_17_pad_type_0, strides = var_362, weight = lora_out_19_weight_0_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("lora_out_19_cast_fp16")];
            tensor<fp16, [1, 5120, 1, 1500]> input_15_cast_fp16 = add(x = pretrained_out_9_cast_fp16, y = lora_out_19_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> input_17_mode_0 = const()[name = tensor<string, []>("input_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 5120, 1, 1500]> input_17_cast_fp16 = gelu(mode = input_17_mode_0, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<int32, [2]> var_376 = const()[name = tensor<string, []>("op_376"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_378 = const()[name = tensor<string, []>("op_378"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_11_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_11_pad_0 = const()[name = tensor<string, []>("pretrained_out_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 5120, 1, 1]> layers_0_fc2_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3276800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21790848))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25067712))), name = tensor<string, []>("layers_0_fc2_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 5120, 1, 1])];
            tensor<fp16, [1280]> layers_0_fc2_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_fc2_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25067840)))];
            tensor<fp16, [1, 1280, 1, 1500]> pretrained_out_11_cast_fp16 = conv(bias = layers_0_fc2_pretrained_bias_to_fp16, dilations = var_378, groups = var_180, pad = pretrained_out_11_pad_0, pad_type = pretrained_out_11_pad_type_0, strides = var_376, weight = layers_0_fc2_pretrained_weight_to_fp16_palettized, x = input_17_cast_fp16)[name = tensor<string, []>("pretrained_out_11_cast_fp16")];
            tensor<int32, [2]> var_382 = const()[name = tensor<string, []>("op_382"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_384 = const()[name = tensor<string, []>("op_384"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 5120, 1, 1]> layers_0_fc2_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_fc2_loraA_weight_to_fp16"), val = tensor<fp16, [16, 5120, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25070464)))];
            tensor<fp16, [1, 16, 1, 1500]> input_19_cast_fp16 = conv(dilations = var_384, groups = var_180, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = var_382, weight = layers_0_fc2_loraA_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [2]> var_388 = const()[name = tensor<string, []>("op_388"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_390 = const()[name = tensor<string, []>("op_390"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_21_pad_type_0 = const()[name = tensor<string, []>("lora_out_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_21_pad_0 = const()[name = tensor<string, []>("lora_out_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_23_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_23_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25234368)))];
            tensor<fp16, [1, 1280, 1, 1500]> lora_out_23_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_390, groups = var_180, pad = lora_out_21_pad_0, pad_type = lora_out_21_pad_type_0, strides = var_388, weight = lora_out_23_weight_0_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("lora_out_23_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> hidden_states_5_cast_fp16 = add(x = pretrained_out_11_cast_fp16, y = lora_out_23_cast_fp16)[name = tensor<string, []>("hidden_states_5_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = hidden_states_5_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, []> var_404 = const()[name = tensor<string, []>("op_404"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_406 = const()[name = tensor<string, []>("op_406"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_407 = const()[name = tensor<string, []>("op_407"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_417 = const()[name = tensor<string, []>("op_417"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_5_cast_fp16 = reduce_mean(axes = var_417, keep_dims = var_407, x = inputs_5_cast_fp16)[name = tensor<string, []>("channels_mean_5_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_5_cast_fp16 = sub(x = inputs_5_cast_fp16, y = channels_mean_5_cast_fp16)[name = tensor<string, []>("zero_mean_5_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_sq_5_cast_fp16 = mul(x = zero_mean_5_cast_fp16, y = zero_mean_5_cast_fp16)[name = tensor<string, []>("zero_mean_sq_5_cast_fp16")];
            tensor<int32, [1]> var_421 = const()[name = tensor<string, []>("op_421"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_422_cast_fp16 = reduce_mean(axes = var_421, keep_dims = var_407, x = zero_mean_sq_5_cast_fp16)[name = tensor<string, []>("op_422_cast_fp16")];
            tensor<fp16, []> var_423_to_fp16 = const()[name = tensor<string, []>("op_423_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_424_cast_fp16 = add(x = var_422_cast_fp16, y = var_423_to_fp16)[name = tensor<string, []>("op_424_cast_fp16")];
            tensor<fp32, []> denom_5_epsilon_0 = const()[name = tensor<string, []>("denom_5_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1500]> denom_5_cast_fp16 = rsqrt(epsilon = denom_5_epsilon_0, x = var_424_cast_fp16)[name = tensor<string, []>("denom_5_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> out_5_cast_fp16 = mul(x = zero_mean_5_cast_fp16, y = denom_5_cast_fp16)[name = tensor<string, []>("out_5_cast_fp16")];
            tensor<fp16, [1280]> obj_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_5_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25275392)))];
            tensor<fp16, [1280]> obj_5_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_5_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25278016)))];
            tensor<fp16, []> obj_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> obj_5_cast_fp16 = batch_norm(beta = obj_5_beta_0_to_fp16, epsilon = obj_5_epsilon_0_to_fp16, gamma = obj_5_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_5_cast_fp16)[name = tensor<string, []>("obj_5_cast_fp16")];
            tensor<int32, [2]> var_442 = const()[name = tensor<string, []>("op_442"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_444 = const()[name = tensor<string, []>("op_444"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_13_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_13_pad_0 = const()[name = tensor<string, []>("pretrained_out_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_q_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25280640))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26099904))), name = tensor<string, []>("layers_1_self_attn_q_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_1_self_attn_q_proj_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_q_proj_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26100032)))];
            tensor<fp16, [1, 1280, 1, 1500]> pretrained_out_13_cast_fp16 = conv(bias = layers_1_self_attn_q_proj_pretrained_bias_to_fp16, dilations = var_444, groups = var_406, pad = pretrained_out_13_pad_0, pad_type = pretrained_out_13_pad_type_0, strides = var_442, weight = layers_1_self_attn_q_proj_pretrained_weight_to_fp16_palettized, x = obj_5_cast_fp16)[name = tensor<string, []>("pretrained_out_13_cast_fp16")];
            tensor<int32, [2]> var_448 = const()[name = tensor<string, []>("op_448"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_450 = const()[name = tensor<string, []>("op_450"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_1_self_attn_q_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_q_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26102656)))];
            tensor<fp16, [1, 16, 1, 1500]> input_21_cast_fp16 = conv(dilations = var_450, groups = var_406, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = var_448, weight = layers_1_self_attn_q_proj_loraA_weight_to_fp16, x = obj_5_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<int32, [2]> var_454 = const()[name = tensor<string, []>("op_454"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_456 = const()[name = tensor<string, []>("op_456"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_25_pad_type_0 = const()[name = tensor<string, []>("lora_out_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_25_pad_0 = const()[name = tensor<string, []>("lora_out_25_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_27_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_27_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26143680)))];
            tensor<fp16, [1, 1280, 1, 1500]> lora_out_27_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_456, groups = var_406, pad = lora_out_25_pad_0, pad_type = lora_out_25_pad_type_0, strides = var_454, weight = lora_out_27_weight_0_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("lora_out_27_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> query_3_cast_fp16 = add(x = pretrained_out_13_cast_fp16, y = lora_out_27_cast_fp16)[name = tensor<string, []>("query_3_cast_fp16")];
            tensor<int32, [2]> var_466 = const()[name = tensor<string, []>("op_466"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_468 = const()[name = tensor<string, []>("op_468"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_15_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_15_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_15_pad_0 = const()[name = tensor<string, []>("pretrained_out_15_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_k_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26184704))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27003968))), name = tensor<string, []>("layers_1_self_attn_k_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> pretrained_out_15_cast_fp16 = conv(dilations = var_468, groups = var_406, pad = pretrained_out_15_pad_0, pad_type = pretrained_out_15_pad_type_0, strides = var_466, weight = layers_1_self_attn_k_proj_pretrained_weight_to_fp16_palettized, x = obj_5_cast_fp16)[name = tensor<string, []>("pretrained_out_15_cast_fp16")];
            tensor<int32, [2]> var_472 = const()[name = tensor<string, []>("op_472"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_474 = const()[name = tensor<string, []>("op_474"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_23_pad_type_0 = const()[name = tensor<string, []>("input_23_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_23_pad_0 = const()[name = tensor<string, []>("input_23_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_1_self_attn_k_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_k_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27004096)))];
            tensor<fp16, [1, 16, 1, 1500]> input_23_cast_fp16 = conv(dilations = var_474, groups = var_406, pad = input_23_pad_0, pad_type = input_23_pad_type_0, strides = var_472, weight = layers_1_self_attn_k_proj_loraA_weight_to_fp16, x = obj_5_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [2]> var_478 = const()[name = tensor<string, []>("op_478"), val = tensor<int32, [2]>([1, 1])];
